{
  "command": "top",
  "show_version": "top -v | head -1 | awk '{print $2}'",
  "supported_versions": ["3.3.15"],
  "arguments": [
    {
      "keyword": "-b",
      "help": "Starts top in Batch mode, which could be useful for sending output from top to other programs or to a file.  In this mode, top will not accept input and runs until the iterations limit you've set with the `-n' command-line option or until killed."
    },
    {
      "keyword": "-c",
      "help": "Starts top with the last remembered `c' state reversed.  Thus, if top was displaying command lines, now that field will show program names, and vice versa.  See the `c' interactive command for additional information."
    },
    {
      "keyword": "-d",
      "alias": "",
      "variable": "Delay-time",
      "help": "Specifies the delay between screen updates as: -d ss.t (secs.tenths), and overrides the corresponding value in one's personal configuration file or the startup default.  Later this can be changed with the `d' or `s' in teractive commands."
    },
    {
      "keyword": "-E",
      "variable": "Extend-Memory-Scaling",
      "choices": ["k", "m", "g", "t", "p", "e"],
      "help": "Instructs top to force summary area memory to be scaled as: k - kibibytes, m - mebibytes, g - gibibytes, t - tebibytes, p - pebibytes, e - exbibytes"
    },
    {
      "keyword": "-H",
      "help": "Instructs top to display individual threads.  Without this command-line option a summation of all threads in each process is shown.  Later this can be changed with the `H' interactive command."
    },
    {
      "keyword": "-i",
      "help": "Starts top with the last remembered `i' state reversed.  When this toggle is Off, tasks that have not used any CPU since the last update will not be displayed. For additional information regarding this toggle see topic 4c. TASK AREA Commands, SIZE."
    },
    {
      "keyword": "-n",
      "variable": "number",
      "help": "Specifies the maximum number of iterations, or frames, top should produce before ending."
    },
    {
      "keyword": "-o",
      "variable": "fieldname",
      "help": "Specifies  the  name of the field on which tasks will be sorted, independent of what is reflected in the configuration file.  You can prepend a `+' or `-' to the field name to also override the sort direction.  A leading `+' will force sorting high to low, whereas a `-' will ensure a low to high ordering."
    },
    {
      "keyword": "-O",
      "help": "This option acts as a form of help for the above -o option.  It will cause top to print each of the available field names on a separate line, then quit.  Such names are subject to NLS (National Language Support) translation."
    },
    {
      "keyword": "-p",
      "variable": "pid",
      "help": "Monitor only processes with specified process IDs."
    },
    {
      "keyword": "-s",
      "help": "Starts top with secure mode forced, even for root.  This mode is far better controlled through a system configuration file (see topic 6. FILES)"
    },
    {
      "keyword": "-S",
      "help": "Starts top with the last remembered `S' state reversed. When Cumulative time mode is On, each process is listed with the cpu time that it and its dead children have used. See the `S' interactive command for additional information regarding this mode."
    },
    {
      "keyword": "-u",
      "variable": "user",
      "help": "Display only processes with a user id or user name matching that given. The `-u' option matches on effective user. Prepending an exclamation point (`!') to the user id or name instructs top to display only processes with users not matching the one provided."
    },
    {
      "keyword": "-U",
      "variable": "user",
      "help": "Display only processes with a user id or user name matching that given. The `-U' option matches on any user (real, effective, saved, or filesystem). Prepending an exclamation point (`!') to the user id or name instructs top to display only processes with users not matching the one provided."
    },
    {
      "keyword": "-w",
      "variable": "width",
      "help": "In Batch mode, when used without an argument top will format output using the COLUMNS= and LINES= environment variables, if set.  Otherwise, width will be fixed at the maximum 512 columns. With an argument, output width can be decreased or increased (up to 512) but the number of rows is considered unlimited. In normal display mode, when used without an argument top will attempt to format output using the COLUMNS= and LINES= environment variables, if set.  With an argument, output width can only  be decreased, not increased.  Whether using environment variables or an argument with -w, when not in Batch mode actual terminal dimensions can never be exceeded. "
    },
    {
      "keyword": "-1",
      "help": "Starts top with the last remembered Cpu States portion of the summary area reversed.  Either all cpu information will be displayed in a single line or each cpu will be displayed separately, depending on the state of the NUMA Node command toggle ('2')"
    },
    {
      "keyword": "-h",
      "alias": "-v",
      "help": "Show library version and the usage prompt, then quit."
    }
  ]
}
