{
  "command": "unzip",
  "show_version": "unzip -v | awk '{print $2}'",
  "supported_versions": [
    "6.00"
  ],
  "arguments": [
    {
      "keyword": "-Z",
      "help": "zipinfo(1) mode.\tIf the first option on the command line is -Z, the remaining options are taken to be zipinfo(1) options.  See the appropriate manual page for a description of these options."
    },
    {
      "keyword": "-c",
      "help": "extract files to stdout/screen (``CRT'').  This option is similar to the -p option except that the name of each file is printed as it is extracted, the -a option is allowed, and  ASCII-EBCDICconversion is automatically performed if appropriate.  This option is not listed in the unzip usage screen."
    },
    {
      "keyword": "-f",
      "help": "freshen  existing files, i.e., extract only those files that already exist on disk and that are newer than the disk copies.  By default unzip queries before overwriting, but the -o option maybe used to suppress the queries.\tNote that under many operating systems, the TZ (timezone) environment variable must be set correctly in order for -f and -u to work properly (under Unix  thevariable\tis  usually set automatically).  The reasons for this are somewhat subtle but have to do with the differences between DOS-format file times (always local time) and Unix-format times(always in GMT/UTC) and the necessity to compare the two.  A typical TZ value is ``PST8PDT'' (US Pacific time with automatic adjustment for Daylight Savings Time or ``summer time'')."
    },
    {
      "keyword": "-l",
      "help": "list archive files (short format).  The names, uncompressed file sizes and modification dates and times of the specified files are printed, along with totals for all files specified.  If  Un‐Zip  was compiled with OS2_EAS defined, the -l option also lists columns for the sizes of stored OS/2 extended attributes (EAs) and OS/2 access control lists (ACLs).  In addition, the zipfilecomment and individual file comments (if any) are displayed.  If a file was archived from a single-case file system (for example, the old MS-DOS FAT file system) and the -L option was  given,the filename is converted to lowercase and is prefixed with a caret (^)."
    },
    {
      "keyword": "-p",
      "help": "extract files to pipe (stdout).  Nothing but the file data is sent to stdout, and the files are always extracted in binary format, just as they are stored (no conversions)."
    },
    {
      "keyword": "-t",
      "help": "test  archive  files.   This  option  extracts each specified file in memory and compares the CRC (cyclic redundancy check, an enhanced checksum) of the expanded file with the original file'sstored CRC value."
    },
    {
      "keyword": "-T",
      "help": "[most OSes] set the timestamp on the archive(s) to that of the newest file in each one.  This corresponds to zip's -go option except that it can be used on wildcard zipfiles (e.g., ``unzip -T\\*.zip'') and is much faster."
    },
    {
      "keyword": "-u",
      "help": "update  existing\tfiles  and create new ones if needed.  This option performs the same function as the -f option, extracting (with query) files that are newer than those with the same name ondisk, and in addition it extracts those files that do not already exist on disk.\tSee -f above for information on setting the timezone properly."
    },
    {
      "keyword": "-v",
      "help": "list archive files (verbose format) or show diagnostic version info.  This option has evolved and now behaves as both an option and a modifier.  As an option it has two purposes:  when a zip‐file  is specified with no other options, -v lists archive files verbosely, adding to the basic -l info the compression method, compressed size, compression ratio and 32-bit CRC.  In contrastto most of the competing utilities, unzip removes the 12 additional header bytes of encrypted entries from the compressed size numbers.  Therefore, compressed size and compression ratio  fig‐ures are independent of the entry's encryption status and show the correct compression performance.  (The complete size of the encrypted compressed data stream for zipfile entries is reportedby the more verbose zipinfo(1) reports, see the separate manual.)  When no zipfile is specified (that is, the complete command is simply ``unzip -v''), a diagnostic screen is printed.  In ad‐dition  to  the  normal  header  with release date and version, unzip lists the home Info-ZIP ftp site and where to find a list of other ftp and non-ftp sites; the target operating system forwhich it was compiled, as well as (possibly) the hardware on which it was compiled, the compiler and version used, and the compilation date; any special compilation options that might  affectthe  program's  operation  (see also DECRYPTION below); and any options stored in environment variables that might do the same (see ENVIRONMENT OPTIONS below).  As a modifier it works in con‐junction with other options (e.g., -t) to produce more verbose or debugging output; this is not yet fully implemented but will be in future releases."
    },
    {
      "keyword": "-z",
      "help": "display only the archive comment."
    },
    {
      "keyword": "-a",
      "help": "convert text files.  Ordinarily all files are extracted exactly as they are stored (as ``binary'' files).  The -a option causes files identified by zip as text files (those with the `t' labelin  zipinfo  listings,  rather  than `b') to be automatically extracted as such, converting line endings, end-of-file characters and the character set itself as necessary.  (For example, Unixfiles use line feeds (LFs) for end-of-line (EOL) and have no end-of-file (EOF) marker; Macintoshes use carriage returns (CRs) for EOLs; and most PC operating systems use CR+LF  for  EOLs  andcontrol-Z for EOF.  In addition, IBM mainframes and the Michigan Terminal System use EBCDIC rather than the more common ASCII character set, and NT supports Unicode.)  Note that zip's identi‐fication of text files is by no means perfect; some ``text'' files may actually be binary and vice versa.  unzip therefore prints ``[text]'' or ``[binary]'' as a visual check for each file itextracts when using the -a option.  The -aa option forces all files to be extracted as text, regardless of the supposed file type.  On VMS, see also -S."
    },
    {
      "keyword": "-b",
      "help": "[general] treat all files as binary (no text conversions).  This is a shortcut for ---a."
    },
    {
      "keyword": "-B",
      "help": "[when compiled with UNIXBACKUP defined] save a backup copy of each overwritten file. The backup file is gets the name of the target file with a tilde and optionally a unique  sequence  number(up to 5 digits) appended.  The sequence number is applied whenever another file with the original name plus tilde already exists.  When used together with the \"overwrite all\" option -o, num‐bered backup files are never created. In this case, all backup files are named as the original file with an appended tilde, existing backup files are deleted  without  notice.\tThis  featureworks similarly to the default behavior of emacs(1) in many locations."
    },
    {
      "keyword": "-C",
      "help": "use case-insensitive matching for the selection of archive entries from the command-line list of extract selection patterns.  unzip's philosophy is ``you get what you ask for'' (this is  alsoresponsible for the -L/-U change; see the relevant options below).  Because some file systems are fully case-sensitive (notably those under the Unix operating system) and because both ZIP ar‐chives and unzip itself are portable across platforms, unzip's default behavior is to match both wildcard and literal filenames case-sensitively.  That is, specifying ``makefile'' on the com‐mand  line  will\tonly match ``makefile'' in the archive, not ``Makefile'' or ``MAKEFILE'' (and similarly for wildcard specifications).  Since this does not correspond to the behavior of manyother operating/file systems (for example, OS/2 HPFS, which preserves mixed case but is not sensitive to it), the -C option may be used to force all filename matches to\tbe  case-insensitive.In  the  example\tabove,\tall  three  files would then match ``makefile'' (or ``make*'', or similar).  The -C option affects file specs in both the normal file list and the excluded-file list(xlist)."
    },
    {
      "keyword": "-D",
      "help": "skip  restoration of timestamps for extracted items.  Normally, unzip tries to restore all meta-information for extracted items that are supplied in the Zip archive (and do not require privi‐leges or impose a security risk).  By specifying -D, unzip is told to suppress restoration of timestamps for directories explicitly created from Zip archive entries.  This option only appliesto  ports  that  support setting timestamps for directories (currently ATheOS, BeOS, MacOS, OS/2, Unix, VMS, Win32, for other unzip ports, -D has no effect).  The duplicated option -DD forcessuppression of timestamp restoration for all extracted entries (files and directories).  This option results in setting the timestamps for all extracted entries to the current time."
    },
    {
      "keyword": "-E",
      "help": "[MacOS only] display contents of MacOS extra field during restore operation."
    },
    {
      "keyword": "-F",
      "help": "[non-Acorn systems supporting long filenames with embedded commas, and only if compiled with ACORN_FTYPE_NFS defined] translate filetype information from ACORN RISC OS extra field blocks intoa  NFS  filetype extension and append it to the names of the extracted files.  (When the stored filename appears to already have an appended NFS filetype extension, it is replaced by the infofrom the extra field.)"
    },
    {
      "keyword": "-i",
      "help": "[MacOS only] ignore filenames stored in MacOS extra fields. Instead, the most compatible filename stored in the generic part of the entry's header is used."
    },
    {
      "keyword": "-j",
      "help": "junk paths.  The archive's directory structure is not recreated; all files are deposited in the extraction directory (by default, the current one)."
    },
    {
      "keyword": "-J",
      "help": "[MacOS only] ignore MacOS extra fields.  All Macintosh specific info is skipped. Data-fork and resource-fork are restored as separate files."
    },
    {
      "keyword": "-K",
      "help": "[AtheOS, BeOS, Unix only] retain SUID/SGID/Tacky file attributes.  Without this flag, these attribute bits are cleared for security reasons."
    },
    {
      "keyword": "-L",
      "help": "convert to lowercase any filename originating on an uppercase-only operating system or file system.  (This was unzip's default behavior in releases prior to 5.11; the new default behavior  isidentical  to  the  old  behavior with the -U option, which is now obsolete and will be removed in a future release.)  Depending on the archiver, files archived under single-case file systems(VMS, old MS-DOS FAT, etc.) may be stored as all-uppercase names; this can be ugly or inconvenient when extracting to a case-preserving file system such as OS/2 HPFS or a  case-sensitive  onesuch  as\tunder  Unix.  By default unzip lists and extracts such filenames exactly as they're stored (excepting truncation, conversion of unsupported characters, etc.); this option causes thenames of all files from certain systems to be converted to lowercase.  The -LL option forces conversion of every filename to lowercase, regardless of the originating file system."
    },
    {
      "keyword": "-M",
      "help": "pipe all output through an internal pager similar to the Unix more(1) command.  At the end of a screenful of output, unzip pauses with a ``--More--'' prompt; the next screenful may be  viewedby  pressing the Enter (Return) key or the space bar.  unzip can be terminated by pressing the ``q'' key and, on some systems, the Enter/Return key.  Unlike Unix more(1), there is no forward-searching or editing capability.\tAlso, unzip doesn't notice if long lines wrap at the edge of the screen, effectively resulting in the printing of two or more lines and the  likelihood  thatsome text will scroll off the top of the screen before being viewed.  On some systems the number of available lines on the screen is not detected, in which case unzip assumes the height is 24lines."
    },
    {
      "keyword": "-n",
      "help": "never overwrite existing files.  If a file already exists, skip the extraction of that file without prompting.  By default unzip queries before extracting any file that\talready  exists;  theuser may choose to overwrite only the current file, overwrite all files, skip extraction of the current file, skip extraction of all existing files, or rename the current file."
    },
    {
      "keyword": "-o",
      "help": "overwrite existing files without prompting.  This is a dangerous option, so use it with care.  (It is often used with -f, however, and is the only way to overwrite directory EAs under OS/2.)"
    },
    {
      "keyword": "-P",
      "variable": "password",
      "help": "use password to decrypt encrypted zipfile entries (if any).  THIS IS INSECURE!  Many multi-user operating systems provide ways for any user to see the current command line of any other\tuser;even  on stand-alone systems there is always the threat of over-the-shoulder peeking.  Storing the plaintext password as part of a command line in an automated script is even worse.  Wheneverpossible, use the non-echoing, interactive prompt to enter passwords.  (And where security is truly important, use strong encryption such as Pretty Good Privacy instead of the relatively weakencryption provided by standard zipfile utilities.)"
    },
    {
      "keyword": "-q",
      "help": "perform  operations  quietly (-qq = even quieter).  Ordinarily unzip prints the names of the files it's extracting or testing, the extraction methods, any file or zipfile comments that may bestored in the archive, and possibly a summary when finished with each archive.  The -q[q] options suppress the printing of some or all of these messages."
    },
    {
      "keyword": "-s",
      "help": "[OS/2, NT, MS-DOS] convert spaces in filenames to underscores.  Since all PC operating systems allow spaces in filenames, unzip  by  default  extracts  filenames  with  spaces  intact  (e.g.,``EA DATA. SF'').  This can be awkward, however, since MS-DOS in particular does not gracefully support spaces in filenames.  Conversion of spaces to underscores can eliminate the awkwardnessin some cases."
    },
    {
      "keyword": "-U",
      "help": "[UNICODE_SUPPORT only]  modify  or  disable  UTF-8  handling.   When UNICODE_SUPPORT is available, the option -U forces unzip to escape all non-ASCII characters from UTF-8 coded filenames as``#Uxxxx'' (for UCS-2 characters, or ``#Lxxxxxx'' for unicode codepoints needing 3 octets).  This option is mainly provided for debugging purpose when the fairly new  UTF-8  support  is  sus‐pected to mangle up extracted filenames."
    },
    {
      "keyword": "-V",
      "help": "retain (VMS) file version numbers.  VMS files can be stored with a version number, in the format file.ext;##.  By default the ``;##'' version numbers are stripped, but this option allows themto be retained.  (On file systems that limit filenames to particularly short lengths, the version numbers may be truncated or stripped regardless of this option.)"
    },
    {
      "keyword": "-W",
      "help": "[only when WILD_STOP_AT_DIR compile-time option enabled] modifies the pattern matching routine so that both `?' (single-char wildcard) and `*' (multi-char wildcard) do not match the directoryseparator character `/'.\t(The two-character sequence ``**'' acts as a multi-char wildcard that includes the directory separator in its matched characters.)"
    },
    {
      "keyword": "-X",
      "help": "[VMS, Unix, OS/2, NT, Tandem] restore owner/protection info (UICs and ACL entries) under VMS, or user and group info (UID/GID) under Unix, or access control lists (ACLs)  under\tcertain  net‐work-enabled  versions of OS/2 (Warp Server with IBM LAN Server/Requester 3.0 to 5.0; Warp Connect with IBM Peer 1.0), or security ACLs under Windows NT.  In most cases this will require spe‐cial system privileges, and doubling the option (-XX) under NT instructs unzip to use privileges for extraction; but under Unix, for example, a user who belongs to several groups can  restorefiles  owned  by any of those groups, as long as the user IDs match his or her own.  Note that ordinary file attributes are always restored--this option applies only to optional, extra owner‐ship info available on some operating systems.  [NT's access control lists do not appear to be especially compatible with OS/2's, so no attempt is made at cross-platform portability of accessprivileges.  It is not clear under what conditions this would ever be useful anyway.]"
    },
    {
      "keyword": "-$",
      "help": "restore the volume label if the extraction medium is removable (e.g., a diskette).  Doubling the option (-$$) allows fixed media (hard disks) to be labelled  as  well. By default, volume labels are ignored."
    }, 
    {
      "keyword": "-^",
      "help": "allow control characters in names of extracted ZIP archive entries. "
    },
    {
      "variable": "file.zip",
      "type": "file",
      "help": "Path of the ZIP archive. Wildcards are allowed.",
      "required": true
    },
    {
      "variable": "members",
      "help": "An optional list of archive members to be processed, separated by spaces. Regular expressions (wildcards) may be used to match multiple members."
    },
    {
      "keyword": "-x",
      "variable": "xfile",
      "help": "An optional list of archive members to be excluded from processing. Wildcards are allowed. "
    },
    {
      "keyword": "-d",
      "variable": "exdir",
      "type": "directory",
      "help": "An optional directory to which to extract files. By default, all files and subdirectories are recreated in the current directory."
    }
  ]
}
